Revit 2024 API
FilterStringRuleEvaluator Members
The FilterStringRuleEvaluator type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FilterStringRuleEvaluator
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Evaluate
 Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FilterStringRuleEvaluator Class
Autodesk.Revit.DB Namespace